// version 5 原始数据是谷歌坐标GCJ02
var myRelease={	// 版本发布用，如果用于发行版为true,测试版则为false
	edit:false
	}
var vOrgData = new Object, vDataAdded = new Object;	// vDataAdded 是将要加入的数据
var vCurCCells = new Array, vCurFCells = new Array;	//有四份拷贝
// add two attr for vCurCCells and vCurFCells: display(filter) and deleted(delete)
//var vOrgCells = new Array;	//ptr only,改为局部
var vDataChanged=false, vDataSave=false; //标识编辑修改了数据，dataSave是否要存文件
var vDataAppendMode = "";	// 标识数据增加的方式，'new', 'append'

var vCurFatherID = new Number; 
var vMaxID = 0;	//当前可用ID
var vaPtrCellDisplayed = new Array; // 控制显示OBJ的数组。outbound/center/cover = new Array, id = new Number, cellptr=指向cell数组
var vNewDraw = new Object(); // 新画一个网元时用于暂存图画信息，是vaPtrCellDisplayed的一个值。
var vNewCell = new Object();	// 存放新的单元数据

var myCellModel = {center:true,outbound:true}
var myBasicCellData = {ID:0,fatherID:0,name:'',address:'',remarks:'',position:{lat:0,lng:0},outbounds:[{lat:0,lng:0}]};
var myBaseStationData={type:'12',devices:[{system:'4G/3G',subsys:'',num:0,progress:'',radius:0,index:''}]};
var myNetNode={type:'33',devices:[{system:'MSE',num:0},{system:'OLT',subsys:'GPON/XGPON',num:0},{system:'OLT',subsys:'EPON/10GEPON',num:0}]};
var myFTTXData = {type:'32',family:0,port:0,user:0,fiber:0,id:''};
var myAreaData = {type:'31'};

var vMap,vDrawingManager,myPolygonEditor,vDistanceTool;
var myDrawListener;
var vMapType = 'NORMAL', vMapZoom = 0, myZoom = 13; // myZoom 是详细显示的分界点
var mySatMap, myBuildingsMap;

var myLastView={center:null,zoom:null};	//用于恢复原来的图
var myInfoWindow = null; // AMap只能显示一个infowindow，因此只创建一个myInfoWindow，用myShowWindows堆栈保存已经显示的窗口
var myShowWindows = [];	// myShowWindows的内容是一个对象，保存信息窗内容、长宽、在屏幕的位置：{content,width,height,posx,posy}

var vIconEditing; // 修改编辑网元时，中心点的icon图标

var myLock = {	//记录当前操作状态
	lock:false, 	// 鼠标按键锁
	noclick:false,	// 	true 阻止click在地图上发生
	menu:false,	//菜单操作中
	noredraw:false,	// edit当在编辑或生成新的网元时，在放大或移动屏幕时不重画,改名字
	ruler:false,	//测距工作中
	refress:false,	//基站统计窗口，退出时如没有操作过refress，要补做。
	show:false,   // 显示网元信息窗口。
	type:"00",		// 当前操作对象的cell是什么类型,引用deftype的定义，2位字符
	celldisplay:null,	//对象cell指向的显示构件数组
	curid:0,		// 当前操作对象的zIndex即数据中的ID
	x:0,	// 当前屏幕坐标
	y:0,
	fatherid:0,	//改变归属时使用
	selectfather:false	//启动改变归属
}

var colors = [
	{"strokeColor":"red", "strokeOpacity":0.7, "strokeWeight": 2, "fillColor":"", "fillOpacity": 0},
    {"strokeColor":"blue", "strokeOpacity":0.6, "strokeWeight": 1, "fillColor":"", "fillOpacity": 0.1},
    {"strokeColor":"blue", "strokeOpacity":0.5, "strokeWeight": 2, "fillColor":"", "fillOpacity": 0.1}];

var deftype = [	// cells 的type 定义。 exist用于收集cells类型，指现有的数据是否存在此类型
	{'val':'11', 'name':'用户点', exist:false,iConUrl:"img/dot_red.png",x:16,y:16,icon:null},
	{'val':'12', 'name':'室外基站站址', exist:false,iConUrl:null,x:16,y:16,icon:null},
	{'val':'13', 'name':"室内分布站址", exist:false,iConUrl:"img/dot_red.png",x:16,y:16,icon:null},
	{'val':'21', 'name':'管道', exist:false,iConUrl:"img/dot_red.png",x:16,y:16,icon:null},
	{'val':'22', 'name':'光缆', exist:false,iConUrl:"img/dot_red.png",x:16,y:16,icon:null},
	{'val':'23', 'name':'电路', exist:false,iConUrl:"img/dot_red.png",x:16,y:16,icon:null},
	{'val':'31', 'name':'行政区划', exist:false,iConUrl:"img/building-blue.png",x:24,y:24,icon:null},
	{'val':'32', 'name':'光网格', exist:false,iConUrl:"img/dot_red.png",x:8,y:8,icon:null},
	{'val':'33', 'name':'网络节点', exist:false,iConUrl:"img/dot_red.png",x:8,y:8,icon:null} ];
/*
"type":"12XXX" 
    	type.2=密集市区0、普通市区1、郊区乡镇2
    	type.3=规划点、计划点、普通谈点、骨头谈点、建成点、逼迁点、拆除点
 "progress":"规划点、计划点、普通谈点、骨头谈点、建成点、拆除点"
*/
var vPreDefUrban=[
	{"name":"密集市区","iConUrl":"img/dot_red.png","icon":null},
	{"name":"市区","iConUrl":"img/dot_white.png","icon":null},
	{"name":"县城","iConUrl":"img/dot_orange.png","icon":null},
	{"name":"郊区","iConUrl":"img/dot_black.png","icon":null},
	{"name":"乡镇","iConUrl":"img/dot_black.png","icon":null}];
var vPreDefProg =[  // 按进展画中心点,exist for IconSet
	{"name":"规划点",exist:false,"color":"#ADFF2F"},		// 0GreenYellow
	{"name":"计划点", exist:false,"color":"#228B22"},	// 1Gold
	{"name":"普通谈点", exist:false,"color":"D19275"},	// 2ForestGreen
	{"name":"骨头谈点", exist:false,"color":"blue"},		// 3Feldspar
	{"name":"完成点", exist:true,"color":"blue"},		// 4DodgerBlue
	{"name":"逼迁点", exist:true,"color":"grey"},		// 5LightSlateGray
	{"name":"拆除点", exist:true,"color":"black"}];		// 6Navy
var vPreDefDProg=[
	{"name":"规划点",exist:false,"color":"#D19275"},		// 0GreenYellow#ADFF2F
	{"name":"计划点",exist:false, "color":"#FFD700"},	// 1Gold
	{"name":"建设中",exist:false, "color":"#228B22"},	// 2ForestGreen
	{"name":"受阻点",exist:false, "color":"#D19275"}, 	// 3Feldspar
	{"name":"建成点",exist:true, "color":"#1E90FF"},	// 4DodgerBlue
	{"name":"逼迁点",exist:true, "color":"#778899"},	// 5LightSlateGray
	{"name":"拆除点",exist:true, "color":"#000080"}];	// 6Navy

var BSicons=[	//站址和基站的图标 b7-b6:LTE800M, b5-b4:LTE1800M/2100M, b3-b2:2G/3G, b1-b0:站址。取值0:无，1:规划，2:建成。
	{id:85, iConUrl:'img/BS85.png', icon:null},	//1-1-1-1
	{id:42, iConUrl:'img/BS42.png', icon:null},	//0-2-2-2
	//现有2G/3G基站，1,2-1,2-2-2
	{id:10, iConUrl:'img/BS10.png', icon:null},	//0-0-2-2
	{id:74, iConUrl:'img/BS74.png', icon:null},	//1-0-2-2
	{id:90, iConUrl:'img/BS90.png', icon:null},	//1-1-2-2
	{id:106, iConUrl:'img/BS106.png', icon:null},//1-2-2-2
	{id:170, iConUrl:'img/BS170.png', icon:null},	//2-2-2-2
	//现有LTE1800M/2100M，0,1,2-1,2-0-2
	{id:18, iConUrl:'img/BS18.png', icon:null},	//0-1-0-2
	{id:34, iConUrl:'img/BS34.png', icon:null},	//0-2-0-2
	{id:82, iConUrl:'img/BS82.png', icon:null},	//1-1-0-2
	{id:98, iConUrl:'img/BS98.png', icon:null},	//1-2-0-2
	{id:146, iConUrl:'img/BS146.png', icon:null},	//2-1-0-2
	{id:162, iConUrl:'img/BS162.png', icon:null}];//2-2-0-2

var vIniData =  {"file_version":5, "rootID":2, 
		"cells":[
		{"name":"金平北墩","position":{"lng":116.701805,"lat":23.385877},"remarks":"*59*","type":"1214",	"devices":[
	{"system":"4G","subsys":"800M","progress":"0","radius":250},
	{"system":"4G","subsys":"1800M","progress":"4","radius":250},
	{"system":"3G","subsys":"800M","progress":"4","radius":250}],"ID":114,"fatherID":3},
		{"name":"金平南墩","position":{"lng":116.703809,"lat":23.383180},"remarks":"*60*","type":"1214",	"devices":[
	{"system":"4G","subsys":"800M","progress":"0","radius":250},
	{"system":"4G","subsys":"2100M","progress":"4","radius":250},
	{"system":"3G","subsys":"800M","progress":"4","radius":250}],"ID":115,"fatherID":3},
		{"name":"金砂电信","position":{"lng":116.707715,"lat":23.365083},"remarks":"*61*","type":"1214",	"devices":[
	{"system":"4G","subsys":"1800M","progress":"0","radius":250},
	{"system":"4G","subsys":"800M","progress":"0","radius":250}],"ID":116,"fatherID":3},
		{"name":"金砂乡","position":{"lng":116.699298,"lat":23.373170},"remarks":"*62*","type":"1214",	"devices":[
	{"system":"4G","subsys":"800M","progress":"4","radius":250},
	{"system":"4G","subsys":"1800M","progress":"4","radius":250},
	{"system":"3G","subsys":"800M","progress":"4","radius":250}],"ID":117,"fatherID":3},
		{"name":"金砂乡南","position":{"lng":116.697294,"lat":23.369066},"remarks":"*63*","type":"1214",	"devices":[
	{"system":"4G","subsys":"1800M","progress":"0","radius":250}],"ID":118,"fatherID":3},
		{"name":"金山花园","position":{"lng":116.743568,"lat":23.367620},"remarks":"*64*","type":"1210",	"devices":[
	{"system":"4G","subsys":"1800M","progress":"0","radius":250},
	{"system":"4G","subsys":"800M","progress":"0","radius":250},
	{"system":"3G","subsys":"800M","progress":"0","radius":250}],"ID":119,"fatherID":4},
		{"name":"金泰北街","position":{"lng":116.751674,"lat":23.383425},"remarks":"*65*","type":"1214",	"devices":[
	{"system":"4G","subsys":"1800M","progress":"4","radius":250}],"ID":120,"fatherID":4},
		{"name":"汕头市", "ID":2,"fatherID":0,"type":"31","position":{"lat":23.353084,"lng":116.712602},"address":"海滨路49号","outbounds":[
	{"lat":23.500000,"lng":117.069161},{"lat":23.473382,"lng":116.988510},{"lat":23.485995,"lng":116.910381},
	{"lat":23.513089,"lng":116.908115},{"lat":23.537070,"lng":116.915379},{"lat":23.558429,"lng":116.916183},
	{"lat":23.590331,"lng":116.907513},{"lat":23.603455,"lng":116.912819},{"lat":23.620154,"lng":116.896324},
	{"lat":23.615145,"lng":116.878631},{"lat":23.617946,"lng":116.868152},{"lat":23.620603,"lng":116.863937},
	{"lat":23.630329,"lng":116.863808},{"lat":23.633555,"lng":116.860340},{"lat":23.646034,"lng":116.829881},
	{"lat":23.638802,"lng":116.827054},{"lat":23.634712,"lng":116.818192},{"lat":23.627621,"lng":116.821664},
	{"lat":23.622451,"lng":116.831337},{"lat":23.612305,"lng":116.829220},{"lat":23.606778,"lng":116.805313},
	{"lat":23.609325,"lng":116.796822},{"lat":23.579862,"lng":116.782696},{"lat":23.584317,"lng":116.773178},
	{"lat":23.576744,"lng":116.764821},{"lat":23.577360,"lng":116.757759},{"lat":23.589205,"lng":116.753685},
	{"lat":23.599587,"lng":116.738789},{"lat":23.597593,"lng":116.716724},{"lat":23.585083,"lng":116.715099},
	{"lat":23.579721,"lng":116.702239},{"lat":23.574187,"lng":116.703033},{"lat":23.565164,"lng":116.717541},
	{"lat":23.551241,"lng":116.717236},{"lat":23.545948,"lng":116.703674},{"lat":23.502324,"lng":116.707425},
	{"lat":23.463823,"lng":116.716613},{"lat":23.455817,"lng":116.703949},{"lat":23.449277,"lng":116.700123},
	{"lat":23.438072,"lng":116.679763},{"lat":23.428388,"lng":116.669922},{"lat":23.430501,"lng":116.655872},
	{"lat":23.426332,"lng":116.648151},{"lat":23.427519,"lng":116.636105},{"lat":23.425056,"lng":116.632347},
	{"lat":23.432343,"lng":116.621384},{"lat":23.434101,"lng":116.611839},{"lat":23.450350,"lng":116.604465},
	{"lat":23.457277,"lng":116.592880},{"lat":23.468014,"lng":116.584232},{"lat":23.454882,"lng":116.577518},
	{"lat":23.448771,"lng":116.578934},{"lat":23.437555,"lng":116.595306},{"lat":23.424642,"lng":116.594852},
	{"lat":23.425428,"lng":116.582108},{"lat":23.379739,"lng":116.571056},{"lat":23.395093,"lng":116.556030},
	{"lat":23.418612,"lng":116.549332},{"lat":23.432077,"lng":116.533886},{"lat":23.439476,"lng":116.512207},
	{"lat":23.438677,"lng":116.468826},{"lat":23.452371,"lng":116.469447},{"lat":23.478742,"lng":116.491108},
	{"lat":23.490563,"lng":116.492622},{"lat":23.498426,"lng":116.487907},{"lat":23.500397,"lng":116.477562},
	{"lat":23.497615,"lng":116.465744},{"lat":23.468653,"lng":116.426434},{"lat":23.475003,"lng":116.417553},
	{"lat":23.483664,"lng":116.414677},{"lat":23.512964,"lng":116.412964},{"lat":23.512595,"lng":116.408812},
	{"lat":23.500415,"lng":116.401070},{"lat":23.500748,"lng":116.377632},{"lat":23.496280,"lng":116.377784},
	{"lat":23.495715,"lng":116.371758},{"lat":23.476265,"lng":116.363773},{"lat":23.473610,"lng":116.355236},
	{"lat":23.467305,"lng":116.358527},{"lat":23.462353,"lng":116.351650},{"lat":23.454141,"lng":116.351199},
	{"lat":23.446917,"lng":116.327255},{"lat":23.449219,"lng":116.319571},{"lat":23.437963,"lng":116.311829},
	{"lat":23.418865,"lng":116.325058},{"lat":23.409490,"lng":116.346844},{"lat":23.366345,"lng":116.351849},
	{"lat":23.351257,"lng":116.357182},{"lat":23.335809,"lng":116.348804},{"lat":23.338886,"lng":116.328662},
	{"lat":23.332470,"lng":116.320926},{"lat":23.327182,"lng":116.321552},{"lat":23.326903,"lng":116.325915},
	{"lat":23.318589,"lng":116.329845},{"lat":23.306021,"lng":116.327183},{"lat":23.300148,"lng":116.313755},
	{"lat":23.279149,"lng":116.309513},{"lat":23.263506,"lng":116.298653},{"lat":23.237367,"lng":116.289425},
	{"lat":23.216020,"lng":116.263626},{"lat":23.205323,"lng":116.268357},{"lat":23.195432,"lng":116.257484},
	{"lat":23.186818,"lng":116.255379},{"lat":23.164106,"lng":116.255978},{"lat":23.159318,"lng":116.260929},
	{"lat":23.147858,"lng":116.263371},{"lat":23.139107,"lng":116.250293},{"lat":23.133355,"lng":116.262074},
	{"lat":23.119790,"lng":116.265953},{"lat":23.108486,"lng":116.292225},{"lat":23.101612,"lng":116.287430},
	{"lat":23.098174,"lng":116.289482},{"lat":23.097404,"lng":116.301506},{"lat":23.107119,"lng":116.325602},
	{"lat":23.104060,"lng":116.334716},{"lat":23.092986,"lng":116.333012},{"lat":23.087251,"lng":116.341488},
	{"lat":23.072934,"lng":116.342876},{"lat":23.061093,"lng":116.350292},{"lat":23.057247,"lng":116.369962},
	{"lat":23.040811,"lng":116.382729},{"lat":23.045736,"lng":116.395801},{"lat":23.057355,"lng":116.407036},
	{"lat":23.062401,"lng":116.434982},{"lat":23.082042,"lng":116.440249},{"lat":23.090966,"lng":116.449802},
	{"lat":23.093379,"lng":116.462826},{"lat":23.103806,"lng":116.475268},{"lat":23.098307,"lng":116.523193},
	{"lat":23.108203,"lng":116.569077},{"lat":23.108963,"lng":116.602711},{"lat":23.121475,"lng":116.608573},
	{"lat":23.139087,"lng":116.635952},{"lat":23.139169,"lng":116.683910},{"lat":23.142119,"lng":116.693699},
	{"lat":23.167569,"lng":116.727951},{"lat":23.174422,"lng":116.749453},{"lat":23.178813,"lng":116.772900},
	{"lat":23.181664,"lng":116.827530},{"lat":23.190429,"lng":116.842155},{"lat":23.202142,"lng":116.848984},
	{"lat":23.217768,"lng":116.851910},{"lat":23.235364,"lng":116.846058},{"lat":23.247116,"lng":116.830460},
	{"lat":23.266683,"lng":116.815831},{"lat":23.294053,"lng":116.807056},{"lat":23.308704,"lng":116.808033},
	{"lat":23.321381,"lng":116.819740},{"lat":23.358390,"lng":116.904621},{"lat":23.363522,"lng":117.026058},
	{"lat":23.326494,"lng":117.065239},{"lat":23.296242,"lng":117.103382},{"lat":23.289388,"lng":117.128769},
	{"lat":23.275663,"lng":117.161938},{"lat":23.255085,"lng":117.194116},{"lat":23.219866,"lng":117.228252},
	{"lat":23.201299,"lng":117.238991},{"lat":23.192012,"lng":117.250711},{"lat":23.194015,"lng":117.309384},
	{"lat":23.205785,"lng":117.333855},{"lat":23.220472,"lng":117.351480},{"lat":23.244911,"lng":117.359310},
	{"lat":23.279101,"lng":117.357353},{"lat":23.304476,"lng":117.343655},{"lat":23.376165,"lng":117.239983},
	{"lat":23.407440,"lng":117.219482},{"lat":23.464124,"lng":117.199005},{"lat":23.549148,"lng":117.194748},
	{"lat":23.516765,"lng":117.102829},{"lat":23.500000,"lng":117.069161} ]},
		{"name":"金平区", "ID":3,"fatherID":2,"type":"31","position":{"lat":23.367167,"lng":116.707281},"address":"金砂路79号","outbounds":[
	{"lat":23.333333,"lng":116.648557},{"lat":23.343988,"lng":116.680531},{"lat":23.339042,"lng":116.717854},
	{"lat":23.379025,"lng":116.712002},{"lat":23.384308,"lng":116.716282},{"lat":23.391672,"lng":116.715721},
	{"lat":23.398702,"lng":116.699783},{"lat":23.409302,"lng":116.702981},{"lat":23.449277,"lng":116.700123},
	{"lat":23.438072,"lng":116.679763},{"lat":23.428388,"lng":116.669922},{"lat":23.430501,"lng":116.655872},
	{"lat":23.426332,"lng":116.648151},{"lat":23.427519,"lng":116.636105},{"lat":23.425056,"lng":116.632347},
	{"lat":23.432343,"lng":116.621384},{"lat":23.434101,"lng":116.611839},{"lat":23.450350,"lng":116.604465},
	{"lat":23.457277,"lng":116.592880},{"lat":23.468014,"lng":116.584232},{"lat":23.454882,"lng":116.577518},
	{"lat":23.448771,"lng":116.578934},{"lat":23.437555,"lng":116.595306},{"lat":23.424642,"lng":116.594852},
	{"lat":23.425491,"lng":116.582142},{"lat":23.410813,"lng":116.576631},{"lat":23.402598,"lng":116.578240},
	{"lat":23.379739,"lng":116.571056},{"lat":23.347519,"lng":116.577477},{"lat":23.340956,"lng":116.566501},
	{"lat":23.333811,"lng":116.574081},{"lat":23.326897,"lng":116.570034},{"lat":23.322634,"lng":116.572032},
	{"lat":23.316510,"lng":116.589230},{"lat":23.318783,"lng":116.595318},{"lat":23.334127,"lng":116.597111},
	{"lat":23.338724,"lng":116.603607},{"lat":23.338196,"lng":116.610844},{"lat":23.327581,"lng":116.625931},
	{"lat":23.333333,"lng":116.648557} ]},
		{"name":"龙湖区", "ID":4,"fatherID":2,"type":"31","position":{"lat":23.363661,"lng":116.752559},"address":"龙湖区长平路丰华庄3幢","outbounds":[
	{"lat":23.331057,"lng":116.750000},{"lat":23.328692,"lng":116.762982},{"lat":23.322339,"lng":116.773472},
	{"lat":23.294053,"lng":116.807056},{"lat":23.308704,"lng":116.808033},{"lat":23.321381,"lng":116.819740},
	{"lat":23.336329,"lng":116.855545},{"lat":23.374819,"lng":116.833103},{"lat":23.379702,"lng":116.819927},
	{"lat":23.397965,"lng":116.812383},{"lat":23.414505,"lng":116.811760},{"lat":23.428119,"lng":116.804203},
	{"lat":23.453415,"lng":116.751965},{"lat":23.458159,"lng":116.735546},{"lat":23.475455,"lng":116.714581},
	{"lat":23.463823,"lng":116.716613},{"lat":23.455817,"lng":116.703949},{"lat":23.447504,"lng":116.699351},
	{"lat":23.436661,"lng":116.703064},{"lat":23.422138,"lng":116.700146},{"lat":23.409302,"lng":116.702981},
	{"lat":23.398702,"lng":116.699783},{"lat":23.391672,"lng":116.715721},{"lat":23.384308,"lng":116.716282},
	{"lat":23.379025,"lng":116.712002},{"lat":23.339042,"lng":116.717854},{"lat":23.331057,"lng":116.750000} ]},
		{"name":"濠江区", "ID":5,"fatherID":2,"type":"31","position":{"lat":23.273329,"lng":116.729746},"address":"达濠海马池电信大楼","outbounds":[
	{"lat":23.333333,"lng":116.648557},{"lat":23.327551,"lng":116.631184},{"lat":23.333044,"lng":116.615208},
	{"lat":23.311045,"lng":116.617496},{"lat":23.313665,"lng":116.624611},{"lat":23.308422,"lng":116.630900},
	{"lat":23.289019,"lng":116.633747},{"lat":23.273445,"lng":116.631241},{"lat":23.268347,"lng":116.621833},
	{"lat":23.264466,"lng":116.622493},{"lat":23.255394,"lng":116.632747},{"lat":23.241231,"lng":116.639915},
	{"lat":23.231106,"lng":116.657715},{"lat":23.168371,"lng":116.730465},{"lat":23.178813,"lng":116.772900},
	{"lat":23.181664,"lng":116.827530},{"lat":23.190429,"lng":116.842155},{"lat":23.202142,"lng":116.848984},
	{"lat":23.217768,"lng":116.851910},{"lat":23.235364,"lng":116.846058},{"lat":23.247116,"lng":116.830460},
	{"lat":23.266683,"lng":116.815831},{"lat":23.294053,"lng":116.807056},{"lat":23.322339,"lng":116.773472},
	{"lat":23.328692,"lng":116.762982},{"lat":23.343880,"lng":116.696853},{"lat":23.343988,"lng":116.680531},
	{"lat":23.333333,"lng":116.648557} ]},
		{"name":"潮阳区", "ID":6,"fatherID":2,"type":"31","position":{"lat":23.244612,"lng":116.623093},"address":"新华大道","outbounds":[
	{"lat":23.313438,"lng":116.625000},{"lat":23.311045,"lng":116.617496},{"lat":23.333044,"lng":116.615208},
	{"lat":23.339032,"lng":116.608109},{"lat":23.334127,"lng":116.597111},{"lat":23.318783,"lng":116.595318},
	{"lat":23.316510,"lng":116.589230},{"lat":23.322634,"lng":116.572032},{"lat":23.326897,"lng":116.570034},
	{"lat":23.333811,"lng":116.574081},{"lat":23.340956,"lng":116.566501},{"lat":23.347519,"lng":116.577477},
	{"lat":23.371583,"lng":116.573975},{"lat":23.379739,"lng":116.571056},{"lat":23.395093,"lng":116.556030},
	{"lat":23.412295,"lng":116.553024},{"lat":23.428406,"lng":116.539661},{"lat":23.437490,"lng":116.523365},
	{"lat":23.439476,"lng":116.512207},{"lat":23.438677,"lng":116.468826},{"lat":23.452371,"lng":116.469447},
	{"lat":23.465446,"lng":116.482555},{"lat":23.483323,"lng":116.492378},{"lat":23.492857,"lng":116.492217},
	{"lat":23.499779,"lng":116.485222},{"lat":23.497615,"lng":116.465744},{"lat":23.468653,"lng":116.426434},
	{"lat":23.475003,"lng":116.417553},{"lat":23.510278,"lng":116.414825},{"lat":23.512595,"lng":116.408812},
	{"lat":23.500415,"lng":116.401070},{"lat":23.500748,"lng":116.377632},{"lat":23.496280,"lng":116.377784},
	{"lat":23.495715,"lng":116.371758},{"lat":23.476265,"lng":116.363773},{"lat":23.473610,"lng":116.355236},
	{"lat":23.467305,"lng":116.358527},{"lat":23.462353,"lng":116.351650},{"lat":23.454141,"lng":116.351199},
	{"lat":23.446917,"lng":116.327255},{"lat":23.449219,"lng":116.319571},{"lat":23.437963,"lng":116.311829},
	{"lat":23.418865,"lng":116.325058},{"lat":23.409490,"lng":116.346844},{"lat":23.366345,"lng":116.351849},
	{"lat":23.351257,"lng":116.357182},{"lat":23.335809,"lng":116.348804},{"lat":23.338886,"lng":116.328662},
	{"lat":23.332470,"lng":116.320926},{"lat":23.327182,"lng":116.321552},{"lat":23.326903,"lng":116.325915},
	{"lat":23.318589,"lng":116.329845},{"lat":23.306021,"lng":116.327183},{"lat":23.302349,"lng":116.331744},
	{"lat":23.292080,"lng":116.350160},{"lat":23.283601,"lng":116.385707},{"lat":23.285675,"lng":116.396388},
	{"lat":23.279960,"lng":116.401206},{"lat":23.283479,"lng":116.411723},{"lat":23.279658,"lng":116.426273},
	{"lat":23.275325,"lng":116.430145},{"lat":23.277430,"lng":116.442951},{"lat":23.286179,"lng":116.444600},
	{"lat":23.284429,"lng":116.453255},{"lat":23.272207,"lng":116.463230},{"lat":23.258214,"lng":116.456688},
	{"lat":23.238070,"lng":116.460880},{"lat":23.230875,"lng":116.468459},{"lat":23.230346,"lng":116.474868},
	{"lat":23.216046,"lng":116.471340},{"lat":23.207725,"lng":116.478691},{"lat":23.208176,"lng":116.502652},
	{"lat":23.202830,"lng":116.503956},{"lat":23.200593,"lng":116.514954},{"lat":23.202575,"lng":116.528168},
	{"lat":23.218862,"lng":116.532029},{"lat":23.218567,"lng":116.540524},{"lat":23.210691,"lng":116.547318},
	{"lat":23.212176,"lng":116.553024},{"lat":23.225609,"lng":116.549934},{"lat":23.231018,"lng":116.590420},
	{"lat":23.223634,"lng":116.614101},{"lat":23.217284,"lng":116.621059},{"lat":23.206322,"lng":116.621929},
	{"lat":23.185730,"lng":116.605480},{"lat":23.169430,"lng":116.598949},{"lat":23.143598,"lng":116.597753},
	{"lat":23.112680,"lng":116.602711},{"lat":23.121475,"lng":116.608573},{"lat":23.139087,"lng":116.635952},
	{"lat":23.139169,"lng":116.683910},{"lat":23.142119,"lng":116.693699},{"lat":23.168371,"lng":116.730465},
	{"lat":23.231106,"lng":116.657715},{"lat":23.241231,"lng":116.639915},{"lat":23.255394,"lng":116.632747},
	{"lat":23.260984,"lng":116.624942},{"lat":23.268347,"lng":116.621833},{"lat":23.271104,"lng":116.629222},
	{"lat":23.281809,"lng":116.633948},{"lat":23.308422,"lng":116.630900},{"lat":23.313438,"lng":116.625000} ]},
		{"name":"潮南区", "ID":7,"fatherID":2,"type":"31","position":{"lat":23.243600,"lng":116.414629},"address":"金光南路159号","outbounds":[
	{"lat":23.166666,"lng":116.598622},{"lat":23.185730,"lng":116.605480},{"lat":23.206322,"lng":116.621929},
	{"lat":23.217284,"lng":116.621059},{"lat":23.223634,"lng":116.614101},{"lat":23.231018,"lng":116.590420},
	{"lat":23.225609,"lng":116.549934},{"lat":23.212176,"lng":116.553024},{"lat":23.210691,"lng":116.547318},
	{"lat":23.218567,"lng":116.540524},{"lat":23.218862,"lng":116.532029},{"lat":23.202575,"lng":116.528168},
	{"lat":23.200593,"lng":116.514954},{"lat":23.202830,"lng":116.503956},{"lat":23.208176,"lng":116.502652},
	{"lat":23.207725,"lng":116.478691},{"lat":23.216046,"lng":116.471340},{"lat":23.230346,"lng":116.474868},
	{"lat":23.230875,"lng":116.468459},{"lat":23.238070,"lng":116.460880},{"lat":23.258214,"lng":116.456688},
	{"lat":23.272207,"lng":116.463230},{"lat":23.284429,"lng":116.453255},{"lat":23.286179,"lng":116.444600},
	{"lat":23.277430,"lng":116.442951},{"lat":23.275325,"lng":116.430145},{"lat":23.279658,"lng":116.426273},
	{"lat":23.283479,"lng":116.411723},{"lat":23.279960,"lng":116.401206},{"lat":23.285675,"lng":116.396388},
	{"lat":23.283601,"lng":116.385707},{"lat":23.292080,"lng":116.350160},{"lat":23.306021,"lng":116.327183},
	{"lat":23.300148,"lng":116.313755},{"lat":23.279149,"lng":116.309513},{"lat":23.263506,"lng":116.298653},
	{"lat":23.237367,"lng":116.289425},{"lat":23.216020,"lng":116.263626},{"lat":23.205323,"lng":116.268357},
	{"lat":23.195432,"lng":116.257484},{"lat":23.186818,"lng":116.255379},{"lat":23.164106,"lng":116.255978},
	{"lat":23.159318,"lng":116.260929},{"lat":23.147858,"lng":116.263371},{"lat":23.139107,"lng":116.250293},
	{"lat":23.133355,"lng":116.262074},{"lat":23.119790,"lng":116.265953},{"lat":23.108486,"lng":116.292225},
	{"lat":23.101612,"lng":116.287430},{"lat":23.098174,"lng":116.289482},{"lat":23.097404,"lng":116.301506},
	{"lat":23.107119,"lng":116.325602},{"lat":23.104060,"lng":116.334716},{"lat":23.092986,"lng":116.333012},
	{"lat":23.087251,"lng":116.341488},{"lat":23.072934,"lng":116.342876},{"lat":23.061093,"lng":116.350292},
	{"lat":23.057247,"lng":116.369962},{"lat":23.040811,"lng":116.382729},{"lat":23.045736,"lng":116.395801},
	{"lat":23.057355,"lng":116.407036},{"lat":23.062401,"lng":116.434982},{"lat":23.082042,"lng":116.440249},
	{"lat":23.090966,"lng":116.449802},{"lat":23.093379,"lng":116.462826},{"lat":23.103806,"lng":116.475268},
	{"lat":23.098307,"lng":116.523193},{"lat":23.108203,"lng":116.569077},{"lat":23.108963,"lng":116.602711},
	{"lat":23.143598,"lng":116.597753},{"lat":23.166666,"lng":116.598622} ]},
		{"name":"澄海区", "ID":8,"fatherID":2,"type":"31","position":{"lat":23.453806,"lng":116.762789},"address":"澄城蓬岭路电信大楼","outbounds":[
	{"lat":23.592762,"lng":116.750001},{"lat":23.599587,"lng":116.738789},{"lat":23.599108,"lng":116.719646},
	{"lat":23.594826,"lng":116.714478},{"lat":23.585083,"lng":116.715099},{"lat":23.579721,"lng":116.702239},
	{"lat":23.574187,"lng":116.703033},{"lat":23.565164,"lng":116.717541},{"lat":23.551241,"lng":116.717236},
	{"lat":23.545948,"lng":116.703674},{"lat":23.502324,"lng":116.707425},{"lat":23.475455,"lng":116.714581},
	{"lat":23.458159,"lng":116.735546},{"lat":23.453415,"lng":116.751965},{"lat":23.428119,"lng":116.804203},
	{"lat":23.414505,"lng":116.811760},{"lat":23.397965,"lng":116.812383},{"lat":23.379702,"lng":116.819927},
	{"lat":23.374819,"lng":116.833103},{"lat":23.336329,"lng":116.855545},{"lat":23.356595,"lng":116.900673},
	{"lat":23.450192,"lng":116.901161},{"lat":23.489614,"lng":116.911037},{"lat":23.513089,"lng":116.908115},
	{"lat":23.546026,"lng":116.916286},{"lat":23.562818,"lng":116.915390},{"lat":23.587467,"lng":116.907486},
	{"lat":23.603455,"lng":116.912819},{"lat":23.620154,"lng":116.896324},{"lat":23.615145,"lng":116.878631},
	{"lat":23.617946,"lng":116.868152},{"lat":23.620603,"lng":116.863937},{"lat":23.630329,"lng":116.863808},
	{"lat":23.633555,"lng":116.860340},{"lat":23.646034,"lng":116.829881},{"lat":23.638802,"lng":116.827054},
	{"lat":23.634712,"lng":116.818192},{"lat":23.627621,"lng":116.821664},{"lat":23.622451,"lng":116.831337},
	{"lat":23.612305,"lng":116.829220},{"lat":23.606778,"lng":116.805313},{"lat":23.609325,"lng":116.796822},
	{"lat":23.579862,"lng":116.782696},{"lat":23.584317,"lng":116.773178},{"lat":23.576744,"lng":116.764821},
	{"lat":23.577360,"lng":116.757759},{"lat":23.592762,"lng":116.750001}  ]},
		{"name":"南澳县", "ID":9,"fatherID":2,"type":"31","position":{"lat":23.420467,"lng":117.028987},"address":"龙滨路105号","outbounds":[
	{"lat":23.500000,"lng":117.069161},{"lat":23.473382,"lng":116.988510},{"lat":23.485995,"lng":116.910381},
	{"lat":23.450192,"lng":116.901161},{"lat":23.356595,"lng":116.900673},{"lat":23.363522,"lng":117.026058},
	{"lat":23.326494,"lng":117.065239},{"lat":23.296242,"lng":117.103382},{"lat":23.289388,"lng":117.128769},
	{"lat":23.275663,"lng":117.161938},{"lat":23.255085,"lng":117.194116},{"lat":23.219866,"lng":117.228252},
	{"lat":23.201299,"lng":117.238991},{"lat":23.192012,"lng":117.250711},{"lat":23.194015,"lng":117.309384},
	{"lat":23.205785,"lng":117.333855},{"lat":23.220472,"lng":117.351480},{"lat":23.244911,"lng":117.359310},
	{"lat":23.279101,"lng":117.357353},{"lat":23.304476,"lng":117.343655},{"lat":23.376165,"lng":117.239983},
	{"lat":23.407440,"lng":117.219482},{"lat":23.464124,"lng":117.199005},{"lat":23.549148,"lng":117.194748},
	{"lat":23.516765,"lng":117.102829},{"lat":23.500000,"lng":117.069161}  ]}
	]};